CSI API ETABS v1
cAreaObj.SetLoadTemperature Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadTemperature(
	string Name,
	string LoadPat,
	int MyType,
	double Value,
	string PatternName = "",
	bool Replace = true,
	eItemType ItemType = eItemType.Objects
)
Function SetLoadTemperature (
	Name As String,
	LoadPat As String,
	MyType As Integer,
	Value As Double,
	Optional PatternName As String = "",
	Optional Replace As Boolean = true,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim LoadPat As String
Dim MyType As Integer
Dim Value As Double
Dim PatternName As String
Dim Replace As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetLoadTemperature(Name,
	LoadPat, MyType, Value, PatternName,
	Replace, ItemType)
int SetLoadTemperature(
	String^ Name,
	String^ LoadPat,
	int MyType,
	double Value,
	String^ PatternName = L"",
	bool Replace = true,
	eItemType ItemType = eItemType::Objects
)
abstract SetLoadTemperature :
        Name : string *
        LoadPat : string *
        MyType : int *
        Value : float *
        ?PatternName : string *
        ?Replace : bool *
        ?ItemType : eItemType
(* Defaults:
        let _PatternName = defaultArg PatternName ""
        let _Replace = defaultArg Replace true
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
LoadPat
Type: System.String
MyType
Type: System.Int32
Value
Type: System.Double
PatternName (Optional)
Type: System.String
Replace (Optional)
Type: System.Boolean
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace